---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CableTrayShape
source: html/c475cf88-224e-4b8a-4ffb-9fe80043e02e.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayShape

Shape types enum of cable tray

## Syntax (C#)
```csharp
public enum CableTrayShape
```